app/Controllers/Categories.php

SELECT *
FROM `satisfaction_categories`
---
    public function index(){
        if (!$this->session->get('is_logued_in')) {
            return redirect()->to(base_url().'/auth');
        }

        $SatisfactionCategorieModel = new SatisfactionCategorieModel($db);

        $query = $db->table('satisfaction_categories');
        $query->select('*');
        $data['categories'] = $query->get()->getResultArray();