app/Controllers/Employees.php

    public function profile_view($user_id, $position_id){
        if (!$this->session->get('is_logued_in')) {
            return redirect()->to(base_url().'/auth');
        }

        $employeeModel = new EmployeeModel($db);

        $query = $db->table('employees e');
        $query->select('e.*, u.*, cr.credential, g.gender, ci.civil_status, co.country, n.nationality, t.type_user, s.schooling, o.organization, d.department, p.position');
        $query->join('users u', 'u.user_id = e.user_id ', "left");
        $query->join('credentials cr', 'cr.credential_id = u.credential_id ', "left");
        $query->join('genders g', 'g.gender_id = e.gender_id ', "left");
        $query->join('civil_status ci', 'ci.civil_status_id = e.civil_status_id ', "left");
        $query->join('countries co', 'co.country_id = e.country_id ', "left");
        $query->join('nationalities n', 'n.nationality_id = e.nationality_id ', "left");
        $query->join('type_users t', 't.type_user_id = e.type_user_id ', "left");
        $query->join('schooling s', 's.schooling_id = e.schooling_id ', "left");
        $query->join('organizations o', 'o.organization_id = e.organization_id ', "left");
        $query->join('departments d', 'd.department_id = e.department_id ', "left");
        $query->join('positions p', 'p.position_id = e.position_id ', "left");
        $query->where('e.user_id', $user_id);
        $data['employee'] = $query->get()->getRowArray();
//obtenemos las resoluciones del usuario
        $query = $db->table('resolutions');
        $query->select('*');
        $query->where('user_id', $user_id);
        $data['resolutions'] = $query->get()->getResultArray();
---
SELECT `e`.*, `u`.*, `cr`.`credential`, `g`.`gender`, `ci`.`civil_status`, `co`.`country`, `n`.`nationality`, `t`.`type_user`, `s`.`schooling`, `o`.`organization`, `d`.`department`, `p`.`position`
FROM `employees` `e`
LEFT JOIN `users` `u` ON `u`.`user_id` = `e`.`user_id`
LEFT JOIN `credentials` `cr` ON `cr`.`credential_id` = `u`.`credential_id`
LEFT JOIN `genders` `g` ON `g`.`gender_id` = `e`.`gender_id`
LEFT JOIN `civil_status` `ci` ON `ci`.`civil_status_id` = `e`.`civil_status_id`
LEFT JOIN `countries` `co` ON `co`.`country_id` = `e`.`country_id`
LEFT JOIN `nationalities` `n` ON `n`.`nationality_id` = `e`.`nationality_id`
LEFT JOIN `type_users` `t` ON `t`.`type_user_id` = `e`.`type_user_id`
LEFT JOIN `schooling` `s` ON `s`.`schooling_id` = `e`.`schooling_id`
LEFT JOIN `organizations` `o` ON `o`.`organization_id` = `e`.`organization_id`
LEFT JOIN `departments` `d` ON `d`.`department_id` = `e`.`department_id`
LEFT JOIN `positions` `p` ON `p`.`position_id` = `e`.`position_id`
WHERE `e`.`user_id` = '1'
SELECT *
FROM `resolutions`
WHERE `user_id` = '1'

        $query = $db->table('innovations');
        $query->select('*');
        $query->where('user_id', $user_id);
        $data['innovations'] = $query->get()->getResultArray();
---
SELECT *
FROM `innovations`
WHERE `user_id` = '1'

    public function presentation_view($user_id, $position_id){
        if (!$this->session->get('is_logued_in')) {
            return redirect()->to(base_url().'/auth');
        }

        $employeeModel = new EmployeeModel($db);

        $query = $db->table('employees e');
        $query->select('e.*, u.*, cr.credential, g.gender, ci.civil_status, co.country, n.nationality, t.type_user, s.schooling, o.organization, o.quiz, d.department, p.position');
        $query->join('users u', 'u.user_id = e.user_id ', "left");
        $query->join('credentials cr', 'cr.credential_id = u.credential_id ', "left");
        $query->join('genders g', 'g.gender_id = e.gender_id ', "left");
        $query->join('civil_status ci', 'ci.civil_status_id = e.civil_status_id ', "left");
        $query->join('countries co', 'co.country_id = e.country_id ', "left");
        $query->join('nationalities n', 'n.nationality_id = e.nationality_id ', "left");
        $query->join('type_users t', 't.type_user_id = e.type_user_id ', "left");
        $query->join('schooling s', 's.schooling_id = e.schooling_id ', "left");
        $query->join('organizations o', 'o.organization_id = e.organization_id ', "left");
        $query->join('departments d', 'd.department_id = e.department_id ', "left");
        $query->join('positions p', 'p.position_id = e.position_id ', "left");
        $query->where('e.user_id', $user_id);
        $data['employee'] = $query->get()->getRowArray();

        $query = $db->table('resolutions');
        $query->select('*');
        $query->where('user_id', $user_id);
        $data['resolutions'] = $query->get()->getResultArray();
---
SELECT `e`.*, `u`.*, `cr`.`credential`, `g`.`gender`, `ci`.`civil_status`, `co`.`country`, `n`.`nationality`, `t`.`type_user`, `s`.`schooling`, `o`.`organization`, `o`.`quiz`, `d`.`department`, `p`.`position`
FROM `employees` `e`
LEFT JOIN `users` `u` ON `u`.`user_id` = `e`.`user_id`
LEFT JOIN `credentials` `cr` ON `cr`.`credential_id` = `u`.`credential_id`
LEFT JOIN `genders` `g` ON `g`.`gender_id` = `e`.`gender_id`
LEFT JOIN `civil_status` `ci` ON `ci`.`civil_status_id` = `e`.`civil_status_id`
LEFT JOIN `countries` `co` ON `co`.`country_id` = `e`.`country_id`
LEFT JOIN `nationalities` `n` ON `n`.`nationality_id` = `e`.`nationality_id`
LEFT JOIN `type_users` `t` ON `t`.`type_user_id` = `e`.`type_user_id`
LEFT JOIN `schooling` `s` ON `s`.`schooling_id` = `e`.`schooling_id`
LEFT JOIN `organizations` `o` ON `o`.`organization_id` = `e`.`organization_id`
LEFT JOIN `departments` `d` ON `d`.`department_id` = `e`.`department_id`
LEFT JOIN `positions` `p` ON `p`.`position_id` = `e`.`position_id`
WHERE `e`.`user_id` = '1'
SELECT *
FROM `resolutions`
WHERE `user_id` = '1'

        $query = $db->table('innovations');
        $query->select('*');
        $query->where('user_id', $user_id);
        $data['innovations'] = $query->get()->getResultArray();
---
SELECT *
FROM `innovations`
WHERE `user_id` = '1'


        $satisfaction_categories = $db->table('satisfaction_categories sc');
        $satisfaction_categories->select('*');
        $data['satisfaction_categories'] = $satisfaction_categories->get()->getResultArray();
---
SELECT *
FROM `satisfaction_categories` `sc`

            $satisfaction_mechanisms = $db->table('satisfaction_mechanisms sm');
            $satisfaction_mechanisms->select('*');
            $satisfaction_mechanisms->where('sm.satisfaction_category_id', $data['satisfaction_categories'][$i]['satisfaction_category_id']);
            $data['satisfaction_categories'][$i]['satisfaction_mechanisms'] = $satisfaction_mechanisms->get()->getResultArray();
---
SELECT *
FROM `satisfaction_mechanisms` `sm`
WHERE `sm`.`satisfaction_category_id` = '1'